# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+startup: beamer overview indent
#+LANGUAGE: pt-br
#+TAGS: noexport(n)
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export

#+Title: Algoritmos
#+Subtitle: *INF01202*
#+Author: Prof. Lucas Mello Schnorr
#+Date: \copyleft

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [xcolor=dvipsnames]
#+OPTIONS: title:nil H:1 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+LATEX_HEADER: \input{org-babel.tex}

#+latex: \newcommand{\mytitle}{Revisão Aula =while= e =do-while=}
#+latex: \mytitleslide

* Configuração                                                     :noexport:

#+BEGIN_SRC emacs-lisp
(setq org-latex-listings 'minted
      org-latex-packages-alist '(("" "minted"))
      org-latex-pdf-process
      '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
(setq org-latex-minted-options
       '(("frame" "lines")
         ("fontsize" "\\scriptsize")))
#+END_SRC

#+RESULTS:
| frame    | lines       |
| fontsize | \scriptsize |
* Exercício #1


Refazer com =do-while= ou =while=.

#+latex: \vfill

- O Brasil, com 214 milhões de habitantes, cresce a uma taxa anual de
  1.34% enquanto os Estados Unidos com 332 milhões crescem a uma taxa
  anual de 1.09%.
- Calcule o número de anos que levará para o Brasil ultrapassar os
  Estados Unidos em número de habitantes, considerando-se que a cada
  ano a taxa dos Estados Unidos diminua em 0.1%. A taxa nunca fica
  negativa, no máximo a população permanece a mesma.
- Resposta esperada: ??? anos

* (#1 Taxa de Crescimento Brazil /vs/ EUA)

=rev-a09-taxa.c=
#+attr_latex: :options fontsize=\scriptsize
#+BEGIN_SRC C :tangle e/rev-a09-taxa.c
/* Programa para satisfazer o enunciado sobre a taxa de crescimento com while */
#include <stdio.h>
int main() {
  int qtdadeAnos;
  double popBRA, popEUA;
  double taxaBRA, taxaEUA;

  popBRA = 214.0;
  popEUA = 332.0;
  taxaBRA = 1.34 / 100;
  taxaEUA = 1.09 / 100;

  qtdadeAnos = 0;

  while (popBRA < popEUA) {
    popBRA += popBRA * taxaBRA;
    popEUA += popEUA * taxaEUA;
    printf("%lf %lf\n", popBRA, popEUA);
    taxaEUA = taxaEUA - 0.1 / 100;
    if (taxaEUA < 0) taxaEUA = 0;
    qtdadeAnos += 1;
  }
  printf("Anos: %d\n", qtdadeAnos);
  return 0;
}
#+END_SRC
